[{"id":"624f0f44-721d-11e7-9fd3-aafbca72fcf6","created_at":"Wed Jul 26 16:13:38 UTC 2017","title":"Siri Full Stack Engineer","location":"Cupertino, CA","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Siri Search team is creating groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we create are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri’s universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every day.</p>\n\n<p>Key Qualifications:\n•Experience with Python, Django, ORMs, and REST APIs\n•Familiarity with Javascript / Typescript, NPM, ReactJS / AngularJS, CSS/SCSS/LESS, and HTML\n•Exposure to SQL-databases (PostgreSQL preferred), ElasticSearch, transactions, indexes, joins, and caching\n•Previously worked with Docker, AWS/GCE, nginx, and shell scripting\n•You know the best practices of how to write testable and reusable code\n•Solid understanding of data structures, advanced algorithms and data pipeline architecture, including the operational trade-offs of various designs\n•Good understanding of distributed systems, streaming, big-data processing systems\n•We value aptitude and hunger no less than experience. We welcome talented engineers at all stages of their career -- senior tech leads, new grads, and interns included. We look forward to hearing from you!</p>\n\n<p>Description:</p>\n\n<ul>\n<li>A suite of internal tools to turbo-boost the team to develop human-caliber \"machine reading\" systems</li>\n<li>Web applications to translate unlocked structured data into unprecedented social and business value</li>\n</ul><p>Education:\nBS/MS in Computer Engineering/Computer Science, or equivalent work experience.</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>","how_to_apply":"<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=fb09ece80de16f02b8c92d30acf2b8c2\">https://ars2.equest.com/?response_id=fb09ece80de16f02b8c92d30acf2b8c2</a>\nREQUISITION NUMBER: 83573365</p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/ed0ab896-721c-11e7-9fbb-ec4506a269cd.jpeg","url":"http://jobs.github.com/positions/624f0f44-721d-11e7-9fd3-aafbca72fcf6"},{"id":"52834d26-6cbb-11e7-9ab3-3613d0a21a33","created_at":"Wed Jul 19 19:59:11 UTC 2017","title":"Senior Backend Software Engineer","location":"New York, NY or San Fran, CA","type":"Full Time","description":"<p>We are looking to add a Senior Backend Software Engineer to our Systems pod. This group is focused on the building and maintaining of microservices and the connective tissue between them within our infrastructure. Part of the support areas include video hosting and transcoding, analytics, data ingestion, and publishing workflow. The team is based on both coasts, so this position could be either in NYC or San Francisco.</p>\n\n<p>Responsibilities: </p>\n\n<p>Designing and building APIs for new internal media management and content workflow products\nBuilding integrations with new external services\nWorking with the operations team to improve monitoring on all backend systems and APIs\nWorking with the data engineering team to integrate analytics and insights with our internal tools</p>\n\n<p>Qualifications:</p>\n\n<p>5+ years of real world development experience, ideally with individual services or server-side applications\nA passion for systems development, and beautiful, concise, fast, organized code with Ruby, PHP, Python and/or Node\nThe ability to start a project from scratch, and follow through until completion.\nA programming expert, and can recognize when code isn’t as clean or as efficient as it absolutely possible.\nAble to recognize that things don’t always go perfectly, and can be flexible to adjust as necessary.\nComfortable being on a team and mentoring wherever possible, even outside of your pod.\nDigital media experience a big plus.</p>\n\n<p>About Group Nine Media:</p>\n\n<p>Group Nine Media is the partnership of four mission-driven, category-leading brands covering food, drink &amp; travel (Thrillist), news &amp; entertainment (NowThis), animals (The Dodo) and science, tech &amp; exploration (Seeker). We're one of the world's largest digital-first media companies, boasting over 4 billion video views every month, while providing consumers 360-degree experiences across web, social, VR and live events. At Group Nine Media, we care about the content our brands create, and if you're a talented passionate individual who does too, let's talk.</p>","how_to_apply":"<p><a href=\"https://boards.greenhouse.io/groupninemedia/jobs/715694#.WW-1m4TytEY\">https://boards.greenhouse.io/groupninemedia/jobs/715694#.WW-1m4TytEY</a></p>","company":"Group Nine Media","company_url":"http://www.groupninemedia.com/","company_logo":"http://github-jobs.s3.amazonaws.com/217eab9e-6cbb-11e7-949d-e7739d909736.jpg","url":"http://jobs.github.com/positions/52834d26-6cbb-11e7-9ab3-3613d0a21a33"},{"id":"db6238ae-6bea-11e7-98c7-623fdc5da624","created_at":"Tue Jul 18 18:57:35 UTC 2017","title":"Senior Software Engineer","location":"Palo Alto, CA","type":"Full Time","description":"<p>Uncommon is reinventing the way people discover their next employment opportunity and manage their professional career. Despite an influx of tech startups aimed at improving the hiring space, the process of finding a job or hiring a new employee remains a difficult, expensive and a typically soul-crushing affair.</p>\n\n<p>We're serious when we say that we're going to reinvent this process because we believe these problems will never be solved by iterating old ideas. It's an incredibly ambitious goal, and to reach it we're building a team of crazy-smart and insanely creative out-of-the-box thinkers to take over this industry by making it simple, fast and maybe even fun for both job seekers and employers alike.</p>\n\n<p>Summary:</p>\n\n<p>We are currently seeking a Senior Software Engineer ​to join our team of intelligent, hard­ working, and honest professionals. You will be responsible for our search engine, crawling, and performance optimization.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Owning our matching server. This server is currently written in python and has APIs to find matching candidates for a position, and matching positions for a candidate. You will need to add features to it while simultaneously making it faster and reducing data size.</li>\n<li>Productionizing/optimizing our data science team’s matching algorithms</li>\n<li>Crawling, data extraction</li>\n<li>Writing automated tests for the above</li>\n</ul><p>Requirements:</p>\n\n<ul>\n<li>Minimum 8 years experience as a software engineer</li>\n<li>Knowledge of search concepts/algorithms</li>\n<li>Background in high performance web servers and distributed systems</li>\n<li>Proven experience building lightweight, simple solutions to complex problems</li>\n<li>Ability to prioritize investing in a perfect solution vs releasing faster with a minimal solution</li>\n<li>Knowledge of C</li>\n</ul><p>Bonus</p>\n\n<ul>\n<li>Experience with deployment</li>\n<li>Experience optimizing python and writing python wrappers for C code</li>\n</ul>","how_to_apply":"<p>Email your resume to <a href=\"mailto:jobs@uncommon.co\">jobs@uncommon.co</a></p>","company":"Uncommon","company_url":"http://uncommon.co","company_logo":"http://github-jobs.s3.amazonaws.com/825c3200-6bea-11e7-8905-77cca58d67fe.png","url":"http://jobs.github.com/positions/db6238ae-6bea-11e7-98c7-623fdc5da624"},{"id":"226d6f1c-68de-11e7-9691-02f1b97d96fd","created_at":"Fri Jul 14 21:48:46 UTC 2017","title":"Site Reliability Engineer","location":"San Francisco, CA / Within the USA","type":"Full Time","description":"<p>Thank you for your interest in joining our Web Operations team at Creative Market, where you'll help independent creators make a living doing what they love! Every day, thousands of customers use Creative Market to buy ready-to-use design content (fonts, graphics, templates, website themes, 3d models, etc) directly from top designers around the world.</p>\n\n<p>Join the team to help us continue our meteoric growth, and your work will be used by millions of people every month. As an SRE, you'll help maintain our fantastic uptime, wave the Infrastructure as Code flag, work with our product engineering teams to deliver great new features, and work closely with our engineering leadership on special projects.</p>\n\n<p>This is a full-time position. Remote opportunities are available, but you must be able to work in the United States.</p>\n\n<h2>About our Web Operations team</h2>\n\n<ul>\n<li>We're deployed entirely in AWS, so there's no hardware to manage.</li>\n<li>We auto-scale our app servers and have many user-driven deploys per day.</li>\n<li>We use Chef and an in-house tool (written in Go) for deploying the app and Scalr for orchestration.</li>\n<li>We use Linux, AWS, GitHub, New Relic, Datadog, Pingdom, PagerDuty, Loggly, PackageCloud, and Distil.</li>\n<li>We use CircleCI for CI/CD for Chef.</li>\n</ul><h2>About you</h2>\n\n<ul>\n<li>Things you like: automation, stability, security, high availability, resiliency, simplicity, and performance.</li>\n<li>You have experience deploying an application in a cloud environment.</li>\n<li>You have experience monitoring as many aspects of the application and infrastructure as possible, and alerting when anomalies arise.</li>\n<li>You're a programmer, and proficient in either C, C++, Python, Perl, PHP, Ruby, or the like.</li>\n<li>You're familiar with Chef, and have a good understanding of the LAMP stack, ElasticSearch, networking, and databases.</li>\n<li>You communicate clearly, quickly, and often. You speak up when something doesn't look right, and jump and help others when needed. You also break down and explain complex technical concepts to others.</li>\n<li>You get buy in from your team when presenting a new idea.</li>\n<li>You're curious, like to play with new tech, but know when to stick with the tried-and-true.</li>\n<li>You like to know why something succeeded or failed, and generally want to make things better than they were before.</li>\n<li>You're a champion for good security practices and you understand the balance between security, performance, and ease of use.</li>\n<li>You write tests to ensure that your code doesn't suffer from regressive bugs.</li>\n<li>You jump into action when outages occur and work hard to get services restored.</li>\n<li>You stay organized and prioritize your daily tasks.</li>\n<li>Your soft skills are as honed as your hard skills.</li>\n<li>You're a team player, like to work towards a common goal.</li>\n<li>You strive for simple solutions to problems. The fewer moving parts the better.</li>\n</ul><h2>Your day-to-day</h2>\n\n<ul>\n<li>Participate in our daily stand-up calls.</li>\n<li>Support application developers by adding features and functionality our application servers (PHP). Things like new modules, config changes, etc.</li>\n<li>Respond to, remedy, and prevent site performance incidents and outages.</li>\n<li>Think through ways to prevent or lessen the impact of performance degradations and outages.</li>\n<li>Partake in on-call rotation (we rarely get paged) and escalate to other team members when needed.</li>\n<li>Participate in rare off-hours cutovers and migrations.</li>\n<li>Build tools to automate parts of your day-to-day to make your job easier and tasks less prone to failure.</li>\n<li>Document processes and thoughts behind design decisions you made.</li>\n<li>Build, support, and maintain our internal API infrastructure.</li>\n<li>Track application performance and propose ways to improve key areas of the stack / traffic flow.</li>\n<li>Troubleshoot issues across the infrastructure.</li>\n<li>Set engineering standards, contribute to runbooks, holding us to higher standard</li>\n<li>Put our infrastructure to the test: run fire drills and disaster recovery tests, where we manually trigger infrastructure failures to test our overall resiliency</li>\n</ul><h2>Nice-to-haves</h2>\n\n<ul>\n<li>Lots of AWS experience. You know its quirks, best practices, and dos &amp; don'ts. Familiar with the AWS product family.</li>\n</ul><h2>We're offering</h2>\n\n<ul>\n<li>Competitive compensation</li>\n<li>Stock compensation</li>\n<li>401(k) plan</li>\n<li>Medical, dental, and vision benefits</li>\n<li>Generous paid time off</li>\n<li>New workstation</li>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/creativemarket/739ec8dd-5d50-4c38-949e-b7485653ec86?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/creativemarket/739ec8dd-5d50-4c38-949e-b7485653ec86?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>","company":"Creative Market","company_url":"https://creativemarket.com","company_logo":"http://github-jobs.s3.amazonaws.com/12a612fa-68de-11e7-9929-4e1efd5737e6.png","url":"http://jobs.github.com/positions/226d6f1c-68de-11e7-9691-02f1b97d96fd"},{"id":"c5a8eee8-68db-11e7-90fe-6083baee5de9","created_at":"Fri Jul 14 21:34:45 UTC 2017","title":"Senior Data Scientist, Search & Discovery","location":"San Francisco, CA","type":"Full Time","description":"<p>Thank you for your interest in joining our Discovery team at Creative Market, where you'll help independent creators make a living doing what they love! Every day, thousands of customers use Creative Market to buy ready-to-use design content (fonts, graphics, templates, website themes, 3d models, etc) directly from top designers around the world.</p>\n\n<p>Join the team to help us continue our meteoric growth, and your work will be used by millions of people every month. As a Data Scientist, you'll help write and optimize algorithms, transform your ideas into production A/B tests and user-facing products and services, work with cross-functional teams as well as other engineers to build impactful new features, and also work closely with our engineering leadership on special projects. We have the perfect amount of data: meaningful amounts for training, but not so much as to require massive distributed computing. This allows us to iterate quickly without being bogged down with the typical constraints of massive scale.</p>\n\n<p>This is a full-time position, and you must be able to work in the United States.</p>\n\n<h2>About you</h2>\n\n<ul>\n<li>You hold a Masters or Ph.D. in mathematics, computer science, or electrical engineering (or equivalent experience).</li>\n<li>You like to know why something succeeded or failed, and generally want to make things better than they were before.</li>\n<li>You communicate clearly, quickly, and often. You speak up when something doesn't look right, and jump and help others when needed. You also break down and explain complex technical concepts to others.</li>\n<li>You get buy in from your team when presenting a new idea.</li>\n<li>You're curious, like to play with new tech, but know when to stick with the tried-and-true.</li>\n<li>You're a champion for good security practices and you understand that PII and other sensitive information has no place in offline data stores.</li>\n<li>You stay organized and prioritize your daily tasks.</li>\n<li>Your soft skills are as honed as your hard skills.</li>\n<li>You're a team player, like to work towards a common goal.</li>\n</ul><h2>Your day-to-day</h2>\n\n<ul>\n<li>Data exploration using Python notebooks to uncover insights and new avenues for growth</li>\n<li>Utilize modern supervised and unsupervised machine learning techniques to build new search and discovery algorithms</li>\n<li>Design and analyze A/B experiments (performed on millions of users) to optimize algorithms</li>\n<li>Impact the livelihoods of thousands of independent creatives around the world</li>\n<li>Document processes and thoughts behind design decisions you made</li>\n<li>Set engineering standards, hold us to higher standard</li>\n</ul><h2>Key tech</h2>\n\n<ul>\n<li>Keras/Tensorflow</li>\n<li>Scikit Learn</li>\n<li>Pandas</li>\n<li>Python</li>\n<li>PHP</li>\n<li>Elasticsearch</li>\n<li>Redshift</li>\n</ul><h2>Key algorithms</h2>\n\n<ul>\n<li>Collaborative filtering (matrix factorization)</li>\n<li>Embeddings (word2vec and autoencoders)</li>\n<li>Convolutional and recurrent neural networks</li>\n</ul><h2>We're Offering</h2>\n\n<ul>\n<li>Competitive compensation</li>\n<li>Stock compensation</li>\n<li>401(k) plan</li>\n<li>Medical, dental, and vision benefits</li>\n<li>Generous paid time off</li>\n<li>New workstation</li>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/creativemarket/b737f750-5b70-487d-a664-9e00b6ff0d51?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/creativemarket/b737f750-5b70-487d-a664-9e00b6ff0d51?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>","company":"Creative Market","company_url":"https://creativemarket.com","company_logo":"http://github-jobs.s3.amazonaws.com/be43022e-68db-11e7-9aee-6d011c87466d.png","url":"http://jobs.github.com/positions/c5a8eee8-68db-11e7-90fe-6083baee5de9"},{"id":"fbb50f72-6655-11e7-9e88-3e1a52f6e668","created_at":"Tue Jul 11 16:28:33 UTC 2017","title":"Senior DevOps Engineer","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Are you passionate DevOps engineer, want to work to solve large scale problems? Come join us to help build CI/CD platform to support dozens of applications across Apple. Our DevOps engineering team develops and deploy software which ensures that Apple’s corporate applications are delivered accurately, reliably and with speed. We support both open source and home-grown technologies to provide internal Apple developers with the best possible CI/CD platform. In this role you will have the unique opportunity to own and improve tooling for best of the class large-scale CI/CD platform.</p>\n\n<p>The DevOps engineering team is part of the engineering operations team for corporate systems. This team is directly responsible to build, manage and expand CI/CD platform in a fast paced environment.</p>\n\n<p>Key Qualifications:</p>\n\n<ul>\n<li>Experience designing and working with modern Continues integration and deployment solutions</li>\n<li>5+ years supporting hosted services in a high-volume customer-facing environment</li>\n<li>String knowledge in debugging Unix servers</li>\n<li>DevOps skills in Java, Maven, Jenkins, NodeJS, PHP, Git.</li>\n<li>Experience with configuration management tools such as Ansible, Chef, Puppet and Salt</li>\n<li>Demonstrated ability to write programs using a high-level programming language such Java, Ruby, Python</li>\n<li>Experience with logging infrastructure and tools such as Logstash, Elasticsearch, Kibana, Splunk</li>\n<li>Experience with networking load balancers such as Ngnix, Netscaler, HAProxy</li>\n<li>Background building distributed, server-based infrastructure supporting a high volume of transactions in a mission critical environment</li>\n<li>Demonstrated ability to work on small, focused teams to complete critical milestones under pressure with tight deadlines</li>\n<li>Independently driven, proactive, accountable, reliable, team player</li>\n<li>Drive to take initiative and own issues</li>\n<li>Experience in Dockers, Kafka, MongoDB, Cassandra and Oracle is highly desirable</li>\n</ul><p>Description:\nWorking in DevOps engineering team will expose varieties of challenges. Our team provides Ci/CD platform for large numbers of Applications by building, tuning and supporting highly available system. On any given day, you will find a member of the team fault finding low level issues in different stacks of the tools that make up the platform. As member of this team you will be empowered to work across multiple tools to improve and expand the capabilities. This may include:</p>\n\n<ul>\n<li>Design and implement new software to streamline manual operations</li>\n<li>Triage production issues along with other operational team members</li>\n<li>Conduct root cause analysis of critical issues</li>\n<li>Expand the capacity and performance of the system</li>\n</ul><p>The ideal candidate will be a self-motivated, hands-on, dynamic and detail oriented individual with a strong technical background.</p>\n\n<p>Education:\nBS engineering degree or equivalent.</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>","how_to_apply":"<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=c09b185f5204db338fcbac1a3472505c\">https://ars2.equest.com/?response_id=c09b185f5204db338fcbac1a3472505c</a>\nREQUISITION NUMBER: 83731090</p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/d2892ec6-6655-11e7-8acf-1a6c83fbc0e1.jpeg","url":"http://jobs.github.com/positions/fbb50f72-6655-11e7-9e88-3e1a52f6e668"}]
